(lldb) target create <path to executable>
Current executable set to <path to executable>.
(lldb) settings set stop-disassembly-display never
(lldb) command script import <path to lldb script>
Stop hook #1 added.
(lldb) b main.kt:6
Breakpoint 1: where = lldb_canStepThroughCode.kexe`kfun:#main(kotlin.Array<kotlin.String>){} + <breakpoint offset> at main.kt:6:13, address = <memory address>
(lldb) r
Process <process id> stopped
* thread #<thread id>, stop reason = breakpoint 1.1
    frame #0: <frame pc> lldb_canStepThroughCode.kexe`kfun:#main(args=[]){} at main.kt:6:13
   3
   4
   5   	fun main(args: Array<String>) {
-> 6   	    var x = 1
    	            ^
   7   	    var y = 2
   8   	    var z = x + y
   9   	    println(z)
Process <process id> launched: <path to executable>
(lldb) n
Process <process id> stopped
* thread #<thread id>, stop reason = step over
    frame #0: <frame pc> lldb_canStepThroughCode.kexe`kfun:#main(args=[]){} at main.kt:7:13
   4
   5   	fun main(args: Array<String>) {
   6   	    var x = 1
-> 7   	    var y = 2
    	            ^
   8   	    var z = x + y
   9   	    println(z)
   10  	}
(lldb) n
Process <process id> stopped
* thread #<thread id>, stop reason = step over
    frame #0: <frame pc> lldb_canStepThroughCode.kexe`kfun:#main(args=[]){} at main.kt:8:13
   5   	fun main(args: Array<String>) {
   6   	    var x = 1
   7   	    var y = 2
-> 8   	    var z = x + y
    	            ^
   9   	    println(z)
   10  	}
(lldb) n
Process <process id> stopped
* thread #<thread id>, stop reason = step over
    frame #0: <frame pc> lldb_canStepThroughCode.kexe`kfun:#main(args=[]){} at main.kt:9:13
   6   	    var x = 1
   7   	    var y = 2
   8   	    var z = x + y
-> 9   	    println(z)
    	            ^
   10  	}
(lldb) q
