(lldb) target create <path to executable>
Current executable set to <path to executable>.
(lldb) command script import <path to lldb script>
Stop hook #1 added.
(lldb) b kt42208-2.kt:17
Breakpoint 1: where = lldb_kt42208WithVariable.kexe`kfun:main$lambda$0#internal + 92 at kt42208-2.kt:17:5, address = <memory address>
(lldb) r
Process <process id> stopped
* thread <thread id>, queue = 'com.apple.main-thread', stop reason = breakpoint 1.1
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:main$lambda$0#internal at kt42208-2.kt:17:5
   14  	class A
   15  	val list = mutableListOf<A>()
   16  	inline fun foo() = { ->
-> 17  	    list.add(A())
    	    ^
   18  	}
Target 0: (lldb_kt42208WithVariable.kexe) stopped.
Process <process id> launched: <path to executable>
(lldb) bt
* thread <thread id>, queue = 'com.apple.main-thread', stop reason = breakpoint 1.1
  * frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:main$lambda$0#internal at kt42208-2.kt:17:5
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:$main$lambda$0$FUNCTION_REFERENCE$0.invoke#internal(_this=[]) at kt42208-2.kt:16:20
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:$main$lambda$0$FUNCTION_REFERENCE$0.$<bridge-UNN>invoke(_this=[]){}kotlin.Boolean#internal at kt42208-2.kt:16:20
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:kotlin.Function0#invoke(){}1:0-trampoline at [K][Suspend]Functions:1:1
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:#main(){} at kt42208-1.kt:8:5
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`Konan_start(args=[]) at kt42208-1.kt:6:1
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`Init_and_run_start + 100
    frame <frame id>: <memory address> dyld`start + 2476
(lldb) c
Process <process id> resuming
Process <process id> stopped
* thread <thread id>, queue = 'com.apple.main-thread', stop reason = breakpoint 1.1
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:main$lambda$0#internal at kt42208-2.kt:17:5
   14  	class A
   15  	val list = mutableListOf<A>()
   16  	inline fun foo() = { ->
-> 17  	    list.add(A())
    	    ^
   18  	}
Target 0: (lldb_kt42208WithVariable.kexe) stopped.
(lldb) bt
* thread <thread id>, queue = 'com.apple.main-thread', stop reason = breakpoint 1.1
  * frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:main$lambda$0#internal at kt42208-2.kt:17:5
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:$main$lambda$0$FUNCTION_REFERENCE$0.invoke#internal(_this=[]) at kt42208-2.kt:16:20
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:$main$lambda$0$FUNCTION_REFERENCE$0.$<bridge-UNN>invoke(_this=[]){}kotlin.Boolean#internal at kt42208-2.kt:16:20
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:kotlin.Function0#invoke(){}1:0-trampoline at [K][Suspend]Functions:1:1
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:#main(){} at kt42208-1.kt:9:5
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`Konan_start(args=[]) at kt42208-1.kt:6:1
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`Init_and_run_start + 100
    frame <frame id>: <memory address> dyld`start + 2476
(lldb) c
Process <process id> resuming
Process <process id> stopped
* thread <thread id>, queue = 'com.apple.main-thread', stop reason = breakpoint 1.1
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:main$lambda$0#internal at kt42208-2.kt:17:5
   14  	class A
   15  	val list = mutableListOf<A>()
   16  	inline fun foo() = { ->
-> 17  	    list.add(A())
    	    ^
   18  	}
Target 0: (lldb_kt42208WithVariable.kexe) stopped.
(lldb) bt
* thread <thread id>, queue = 'com.apple.main-thread', stop reason = breakpoint 1.1
  * frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:main$lambda$0#internal at kt42208-2.kt:17:5
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:$main$lambda$0$FUNCTION_REFERENCE$0.invoke#internal(_this=[]) at kt42208-2.kt:16:20
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:$main$lambda$0$FUNCTION_REFERENCE$0.$<bridge-UNN>invoke(_this=[]){}kotlin.Boolean#internal at kt42208-2.kt:16:20
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:kotlin.Function0#invoke(){}1:0-trampoline at [K][Suspend]Functions:1:1
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`kfun:#main(){} at kt42208-1.kt:10:5
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`Konan_start(args=[]) at kt42208-1.kt:6:1
    frame <frame id>: <memory address> lldb_kt42208WithVariable.kexe`Init_and_run_start + 100
    frame <frame id>: <memory address> dyld`start + 2476
(lldb) q
